IRP/src/Catalogs/Items/Items.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>Items</name>
 <hierarchical>true</hierarchical>
 <attributes>
  <name>ItemType</name>
  <type>
   <types>CatalogRef.ItemTypes</types>
  </type>
 </attributes>
 <attributes>
  <name>Unit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <attributes>
  <name>MainPricture</name>
  <comment>Temporary</comment>
  <type>
   <types>ValueStorage</types>
  </type>
 </attributes>
 <attributes>
  <name>Vendor</name>
  <type>
   <types>CatalogRef.Partners</types>
  </type>
 </attributes>
 <attributes>
  <name>ItemID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>100</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>PackageUnit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <attributes>
  <name>ControlCodeString</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>CheckCodeString</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>ControlCodeStringType</name>
  <type>
   <types>EnumRef.ControlCodeStringType</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ConsignorsInfo</name>
  <attributes>
   <name>Company</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
  <attributes>
   <name>Consignor</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/ItemKeys/ItemKeys.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
 <name>ItemKeys</name>
 <attributes>
  <name>Item</name>
  <type>
   <types>CatalogRef.Items</types>
  </type>
 </attributes>
 <attributes>
  <name>Unit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <attributes>
  <name>Specification</name>
  <type>
   <types>CatalogRef.Specifications</types>
  </type>
 </attributes>
 <attributes>
  <name>AffectPricingMD5</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>UniqueMD5</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>50</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>ItemKeyID</name>
  <type>
   <types>String</types>
   <stringQualifiers>
    <length>100</length>
   </stringQualifiers>
  </type>
 </attributes>
 <attributes>
  <name>DefaultBillOfMaterials</name>
  <type>
   <types>CatalogRef.BillOfMaterials</types>
  </type>
 </attributes>
 <attributes>
  <name>UseIncomingStockReservation</name>
  <type>
   <types>Boolean</types>
  </type>
 </attributes>
 <attributes>
  <name>PackageUnit</name>
  <type>
   <types>CatalogRef.Units</types>
  </type>
 </attributes>
 <tabularSections>
  <name>AddAttributes</name>
  <attributes>
   <name>Property</name>
   <type>
    <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>Value</name>
   <type>
    <types>Characteristic.AddAttributeAndProperty</types>
   </type>
  </attributes>
  <attributes>
   <name>SearchLiteral</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>500</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>SpecificationAffectPricingMD5</name>
  <attributes>
   <name>Key</name>
   <type>
    <types>DefinedType.typeRowID</types>
   </type>
  </attributes>
  <attributes>
   <name>AffectPricingMD5</name>
   <type>
    <types>String</types>
    <stringQualifiers>
     <length>100</length>
    </stringQualifiers>
   </type>
  </attributes>
 </tabularSections>
 <tabularSections>
  <name>ConsignorsInfo</name>
  <attributes>
   <name>Company</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
  <attributes>
   <name>Consignor</name>
   <type>
    <types>CatalogRef.Companies</types>
   </type>
  </attributes>
 </tabularSections>
</mdclass:Catalog>

IRP/src/HTTPServices/REST/Module.bsl
Function EndPointPOST(Request)
	Response = New HTTPServiceResponse(200);
	
	RequestData = CommonFunctionsServer.DeserializeJSON(Request.GetBodyAsString());
	If RequestData.Action = "READ_CATALOG_ITEMS" Then
	    Json = Action_READ_CATALOG_ITEMS();
	ElsIf RequestData.Action = "READ_CATALOG_ITEM_KEYS" Then
		Json = Action_READ_CATALOG_ITEM_KEYS(RequestData.Data);
	ElsIf RequestData.Action = "CREATE_DOCUMENT_RETAIL_SALES" Then
		Json = Action_CREATE_DOCUMENT_RETAIL_SALES(RequestData.Data);
	ElsIf RequestData.Action = "WRITE_DOCUMENT_RETAIL_SALES" Then
		Json = Action_WRITE_DOCUMENT_RETAIL_SALES(RequestData.Data);	
	ElsIf RequestData.Action = "SET_PROPERTY" Then
		Json = Action_SET_PROPERTY(RequestData.Data);
	EndIf;
	 
	Response.SetBodyFromString(Json);	
	Return Response;
EndFunction

Function Action_READ_CATALOG_ITEMS()
	Query = New Query();
	Query.Text =	
	 "SELECT
	 |	Items.Ref AS Ref
	 |FROM
	 |	Catalog.Items AS Items";
	QuerySelection = Query.Execute().Select();
	Elements = New Array();
	While QuerySelection.Next() Do
		Element = New Structure();
		Element.Insert("Description",String(QuerySelection.Ref));
		Element.Insert("Ref",String(QuerySelection.Ref.UUID()));
		Elements.Add(Element);
	EndDo;
	//Result = New Structure("Elements", Elements);
	Return CommonFunctionsServer.SerializeJSON(Elements);
EndFunction

Function Action_READ_CATALOG_ITEM_KEYS(jsonFilter)
	Query = New Query();
	Query.Text =	
	 "SELECT
	 |	ItemKeys.Ref AS Ref
	 |FROM
	 |	Catalog.ItemKeys AS ItemKeys
	 |WHERE
	 |	ItemKeys.Item = &Item";
	ArrayOfFilters = CommonFunctionsServer.DeserializeJSON(jsonFilter);
	FilterItemUUID = ArrayOfFilters[0].Value.Ref;
	Query.SetParameter("Item", Catalogs.Items.GetRef(New UUID(FilterItemUUID)));
	
	QuerySelection = Query.Execute().Select();
	Elements = New Array();
	While QuerySelection.Next() Do
		Element = New Structure();
		Element.Insert("Description",String(QuerySelection.Ref));
		Element.Insert("Ref",String(QuerySelection.Ref.UUID()));
		Elements.Add(Element);
	EndDo;
	//Result = New Structure("Elements", Elements);
	Return CommonFunctionsServer.SerializeJSON(Elements);
EndFunction	

Function Action_CREATE_DOCUMENT_RETAIL_SALES(Data)
	Builder = BuilderServer_V2;
	DocMetadata = Metadata.Documents.RetailSalesReceipt;
	Wrapper = Builder.CreateDocument(DocMetadata);
	jsonDataContext = CommonFunctionsServer.SerializeJSONUseXDTO(Wrapper);
	
	DataPresentation = new Structure();
	DataPresentation.Insert("TestPresentationProperty" , String(CurrentSessionDate()));
	jsonDataPresentation = CommonFunctionsServer.SerializeJSON(DataPresentation);
	
	json = CommonFunctionsServer.SerializeJSON(
		New Structure("DataContext, DataPresentation", jsonDataContext, jsonDataPresentation));
	
	Return Json;
EndFunction

Function Action_WRITE_DOCUMENT_RETAIL_SALES(Data)
	Builder = BuilderServer_V2;
	DocMetadata = Metadata.Documents.RetailSalesReceipt;
	
	Wrapper = CommonFunctionsServer.DeserializeJSONUseXDTO(Data);
	Builder.Write(Wrapper, DocMetadata, DocumentWriteMode.Write);
	Result = New Structure("Success", True);
	Return CommonFunctionsServer.SerializeJSON(Result);
EndFunction

Function Action_SET_PROPERTY(jsonData)
	Builder = BuilderServer_V2;
	DocMetadata = Metadata.Documents.RetailSalesReceipt;
	
	Data = CommonFunctionsServer.DeserializeJSON(jsonData);
	Property = CommonFunctionsServer.DeserializeJSON(Data.Value);
	//Property.Name - attribute name
	//Property.Value - attribute value
	
	Wrapper = CommonFunctionsServer.DeserializeJSONUseXDTO(Data.DataContext);
	// Data.Value
	Builder.SetProperty(Wrapper, Wrapper.Attr.Date , CurrentSessionDate());
	
	jsonDataContext = CommonFunctionsServer.SerializeJSONUseXDTO(Wrapper);
	
	DataPresentation = new Structure();
	DataPresentation.Insert("TestPresentationProperty" , "after set property");
	jsonDataPresentation = CommonFunctionsServer.SerializeJSON(DataPresentation);
		
	json = CommonFunctionsServer.SerializeJSON(
		New Structure("DataContext, DataPresentation", jsonDataContext, jsonDataPresentation));
		
	Return json;
EndFunction
